In [1]:
import pandas as pd 
import numpy as np

In [2]:
df=pd.read_csv('student_scores.csv')

In [3]:
df

   Student_ID     Name  Age Gender  Math_Score  Science_Score  English_Score
0           1      Ali   16      M        85.0           78.0           88.0
1           2     Sara   17      F        90.0            NaN           82.0
2           3    Ahmed   16      M        76.0           74.0           80.0
3           4   Ayesha   15      F         NaN           85.0           79.0
4           5    Bilal   17      M        88.0           90.0           85.0
5           6     Hina   16      F        92.0           95.0           91.0
6           7    Usman   15      M        70.0           68.0           72.0
7           8  Mahnoor   16      F        85.0           83.0            NaN
8           9     Zain   17      M        80.0           78.0           81.0
9          10    Laiba   15      F        95.0           92.0           94.0

In [4]:
# handling missing values

In [5]:

df['Math_Score'].fillna(df['Math_Score'].mean(), inplace=True)
df['Science_Score'].fillna(df['Science_Score'].mean(), inplace=True)
df['English_Score'].fillna(df['English_Score'].mean(), inplace=True)

C:\Users\hp\AppData\Local\Temp\ipykernel_17136\772799768.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Math_Score'].fillna(df['Math_Score'].mean(), inplace=True)
C:\Users\hp\AppData\Local\Temp\ipykernel_17136\772799768.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Science_Score'].fillna(df['Science_Score'].mean(), inplace=True)
C:\Users\hp\AppData\Local\Temp\ipykernel_17136\772799768.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['English_Score'].fillna(df['English_Score'].mean(), inplace=True)

In [6]:
df

   Student_ID     Name  Age Gender  Math_Score  Science_Score  English_Score
0           1      Ali   16      M   85.000000      78.000000      88.000000
1           2     Sara   17      F   90.000000      82.555556      82.000000
2           3    Ahmed   16      M   76.000000      74.000000      80.000000
3           4   Ayesha   15      F   84.555556      85.000000      79.000000
4           5    Bilal   17      M   88.000000      90.000000      85.000000
5           6     Hina   16      F   92.000000      95.000000      91.000000
6           7    Usman   15      M   70.000000      68.000000      72.000000
7           8  Mahnoor   16      F   85.000000      83.000000      83.555556
8           9     Zain   17      M   80.000000      78.000000      81.000000
9          10    Laiba   15      F   95.000000      92.000000      94.000000

In [7]:
df.duplicated().sum()

0

In [8]:
# Strip spaces, replace with underscores, make lowercase

In [10]:
df.columns = df.columns.str.strip().str.replace(' ', '_').str.lower()

In [11]:
df

   student_id     name  age gender  math_score  science_score  english_score
0           1      Ali   16      M   85.000000      78.000000      88.000000
1           2     Sara   17      F   90.000000      82.555556      82.000000
2           3    Ahmed   16      M   76.000000      74.000000      80.000000
3           4   Ayesha   15      F   84.555556      85.000000      79.000000
4           5    Bilal   17      M   88.000000      90.000000      85.000000
5           6     Hina   16      F   92.000000      95.000000      91.000000
6           7    Usman   15      M   70.000000      68.000000      72.000000
7           8  Mahnoor   16      F   85.000000      83.000000      83.555556
8           9     Zain   17      M   80.000000      78.000000      81.000000
9          10    Laiba   15      F   95.000000      92.000000      94.000000

In [13]:

df = df.round(2)
df

   student_id     name  age gender  math_score  science_score  english_score
0           1      Ali   16      M       85.00          78.00          88.00
1           2     Sara   17      F       90.00          82.56          82.00
2           3    Ahmed   16      M       76.00          74.00          80.00
3           4   Ayesha   15      F       84.56          85.00          79.00
4           5    Bilal   17      M       88.00          90.00          85.00
5           6     Hina   16      F       92.00          95.00          91.00
6           7    Usman   15      M       70.00          68.00          72.00
7           8  Mahnoor   16      F       85.00          83.00          83.56
8           9     Zain   17      M       80.00          78.00          81.00
9          10    Laiba   15      F       95.00          92.00          94.00

In [14]:
# Save cleaned DataFrame to a new CSV file
df.to_csv("students_cleaned.csv", index=False)